Ebiroll/qemu-stm32/hw/arm/stm32u535_soc.c
    qdev_prop_set_string(dev, "name", name);
    qdev_prop_set_uint64(dev, "size", size);
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);

    sysbus_mmio_map_overlap(SYS_BUS_DEVICE(dev), 0, base, -1000);


    sprintf(sec_name, "SEC_%s", name);
    dev = qdev_new(TYPE_UNIMPLEMENTED_DEVICE);
    qdev_prop_set_string(dev, "name", sec_name);
    qdev_prop_set_uint64(dev, "size", size);
    sysbus_realize_and_unref(SYS_BUS_DEVICE(dev), &error_fatal);

    sysbus_mmio_map_overlap(SYS_BUS_DEVICE(dev), 0, base + 0x10000000, -1000);

}




#define SYSCFG_ADD                     0x40010000

// LPUART1 0x40008000
static const uint32_t usart_addr[] = { 0x40013800, 
        0x40004400, 0x40004800, 0x40004C00 , 0x40005000 }; 
//                                        , 0x40004800,
//                                       0x40007800, 0x40007C00 };
/* At the moment only Timer 2 to 5 are modelled */
//static const uint32_t timer_addr[] = { 0x40000000, 0x40000400,
//                                       0x40000800, 0x40000C00 };

static const uint32_t timer_addr[] = { 0x40012C00, 0x40000000, 0x40000400,
                                       0x40000800, 0x40000C00 , 0x40001000 , 0x40001400 };


// static const uint32_t adc_addr[] = { 0x42028000 };  // 0x42028000


static const uint32_t spi_addr[] =   { 0x40013000, 0x40003800, 0x40003C00 };

//#define EXTI_ADDR                      0x40013C00
#define   EXTI_ADDR         0x4002F400

#define SYSCFG_IRQ               71
#if 0
USART1_IRQn               = 61,     /*!< USART1 global interrupt                                           */
  USART3_IRQn               = 63,     /*!< USART3 global interrupt                                           */
  UART4_IRQn                = 64,     /*!< UART4 global interrupt                                            */
  UART5_IRQn                = 65,     /*!< UART5 global interrupt                                            */
#endif

static const int usart_irq[] = { 61, 62, 63, 64, 65};
static const int timer_irq[] = { 44,45,46,47,48,49,50,51 };
#define ADC_IRQ 18
// TODO SPI3 IRQ is 99!
static const int spi_irq[] =   { 59,60 ,61, 0, 0 };
static const int exti_irq[] =  { 11, 12,13,14,15,16,17,18,
                                 19, 20,21,22,23,24,25,26,27} ;

void init_u5_features(Object *obj);

void init_u5_features(Object *obj) {
    ARMCPU *cpu = ARM_CPU(obj);
    set_feature(&cpu->env, ARM_FEATURE_V8);
    set_feature(&cpu->env, ARM_FEATURE_M);
    set_feature(&cpu->env, ARM_FEATURE_M_MAIN);
    unset_feature(&cpu->env, ARM_FEATURE_M_SECURITY);
    set_feature(&cpu->env, ARM_FEATURE_THUMB_DSP);
    //set_feature(&cpu->env,ARM_FEATURE_V8_1M);
    cpu->midr = 0x410fd213; // r0p3 
    cpu->pmsav7_dregion = 16;
    cpu->sau_sregion = 8;
    cpu->isar.mvfr0 = 0x10110021;
    cpu->isar.mvfr1 = 0x11000011;
    cpu->isar.mvfr2 = 0x00000040;
    cpu->isar.id_pfr0 = 0x00000030;
    cpu->isar.id_pfr1 = 0x00000210;
    cpu->isar.id_dfr0 = 0x00200000;
    cpu->id_afr0 = 0x00000000;
    cpu->isar.id_mmfr0 = 0x00101F40;
    cpu->isar.id_mmfr1 = 0x00000000;
    cpu->isar.id_mmfr2 = 0x01000000;
    cpu->isar.id_mmfr3 = 0x00000000;
    cpu->isar.id_isar0 = 0x01101110;
    cpu->isar.id_isar1 = 0x02212000;
    cpu->isar.id_isar2 = 0x20232232;
    cpu->isar.id_isar3 = 0x01111131;
    cpu->isar.id_isar4 = 0x01310132;
    cpu->isar.id_isar5 = 0x00000000;
    cpu->isar.id_isar6 = 0x00000000;
    cpu->clidr = 0x00000000;
    cpu->ctr = 0x8000c000;
    cpu->env.v7m.secure = false;
}

extern hwaddr bitband_output_addr[2];

static void stm32l552_soc_initfn(Object *obj)
{
    STM32U535State *s = STM32U535_SOC(obj);
    int i;


  bitband_output_addr[1] = 0x50000000;  // OLAS ACHTUNG Fixme 0x50000000

    object_initialize_child(obj, "armv7m", &s->armv7m, TYPE_ARMV7M);

    object_initialize_child(obj, "syscfg", &s->syscfg, TYPE_STM32LXXX_SYSCFG);

    object_initialize_child(obj, "lpuart1", &s->lpuart1,
                            TYPE_STM32L552_USART);


    for (i = 0; i < STM32U535_NUM_USARTS; i++) {
        object_initialize_child(obj, "usart[*]", &s->usart[i],
                                TYPE_STM32L552_USART);
    }

    for (i = 0; i < STM32U535_NUM_TIMERS; i++) {
        object_initialize_child(obj, "timer[*]", &s->timer[i],
                                TYPE_STM32F2XX_TIMER);
    }

    object_initialize_child(obj, "stm32l552-flash", &s->flash_regs, TYPE_STM32_FLASH_REGS);


    object_initialize_child(obj, TYPE_STM32L552_ADC, &s->adc, TYPE_STM32L552_ADC);


    qdev_prop_set_uint32(DEVICE(&s->adc), "input8" /* Version */,
            815);

    qdev_prop_set_uint32(DEVICE(&s->adc), "input9" /* Length? */,
            815);


    //for (i = 0; i < STM_NUM_ADCS; i++) {
    //    object_initialize_child(obj, "adc[*]", &s->adc[i], TYPE_STM32L552_ADC);


    //   qdev_prop_set_uint32(DEVICE(&s->adc[i]), "input9" /* Version */,
    //            122);

    //}

    for (i = 0; i < STM_NUM_SPIS; i++) {
        object_initialize_child(obj, "spi[*]", &s->spi[i], TYPE_STM32F2XX_SPI);

    if (1==1) {
          void *bus;


        bus = qdev_get_child_bus(DEVICE(&s->spi[i]), "ssi");
        object_initialize_child(OBJECT(bus), "nnasic", &s->asic[i], TYPE_NN1002);
        //qdev_prop_set_uint8(&s->asic, "input1" /* Test */,
        //                    47);
        // s->spi[i].ssi = s->asic;


    }

    //qdev_connect_gpio_out(sms->mpu->gpio, SPITZ_GPIO_MAX1111_CS,
    //                    qdev_get_gpio_in(sms->mux, 2));


 


    }
    #define NAME_SIZE 32
    char name[NAME_SIZE];

    for (i = 0; i < STM_NUM_GPIO; i++) {
        snprintf(name, NAME_SIZE, "GPIO%c", 'A' + i);
        object_initialize_child(obj, name, &s->gpio[i], TYPE_STM32FXXX_GPIO);
        s->gpio[i].port_id = i;
        //qdev_prop_set_uint8(DEVICE(&s->gpio[i]), "port_id", i);
        //qdev_prop_set_ptr(DEVICE(s->gpio[i]), "state", &s->state);

    }


    object_initialize_child(obj, "exti", &s->exti, TYPE_STM32L552_EXTI);
    

    object_initialize_child(obj, "stm32l552-rcc", &s->rcc, TYPE_STM32U535_RCC);
    object_initialize_child(obj, "stm32fxxx-rtc", &s->rtc, TYPE_STM32L552_RTC);
    object_initialize_child(obj, "stm32u535-usb", &s->usb, TYPE_STM32U535_USB);

