Ebiroll/qemu-stm32/hw/arm/stm32u535_soc.c
    // object_initialize_child(obj, "stm32l552-dmamux", &s->dmamux, TYPE_STM32L552_DMAMUX);

    // 
    object_initialize_child(obj, "stm32-pwr", &s->pwr, TYPE_STM32U535_PWR);



    s->sysclk = qdev_init_clock_in(DEVICE(s), "sysclk", NULL, NULL, 0);
    s->refclk = qdev_init_clock_in(DEVICE(s), "refclk", NULL, NULL, 0);


}


static int gpio_realize_peripheral(ARMv7MState *cpu, stm32fxxx_gpio *dev, hwaddr base, unsigned int irqnr, Error **errp){
     SysBusDevice *busdev;
     DeviceState *armv7m;

    //object_property_set_bool(OBJECT(dev), "realized", true,  &error_fatal);
    if (!sysbus_realize(SYS_BUS_DEVICE(dev), errp)) {
        return 0;
    }
    busdev = SYS_BUS_DEVICE(dev);
    armv7m = DEVICE(cpu);
    sysbus_mmio_map(busdev, 0, base);
    sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, irqnr));

    //MemoryRegion *flash_alias = g_new(MemoryRegion, 1);
    //memory_region_init_alias(flash_alias, OBJECT(dev),
    //                         "STM32L552.flash.alias", &dev->flash, 0,
    //                         FLASH_SIZE);

    return 0;
}

static void stm32l552_soc_reset(DeviceState *dev)
 {
    STM32U535State *s = STM32U535_SOC(dev);
    /* Failed attempt to set truszone SCB registers 
       by looking at them in the debugger */
    s->armv7m.cpu->env.v7m.secure = s->armv7m.cpu->env.v7m.secure;
    s->armv7m.cpu->env.v7m.aircr = R_V7M_AIRCR_BFHFNMINS_MASK;
    s->armv7m.cpu->env.v7m.nsacr = 0xcff;
    CPUARMState *env = &s->armv7m.cpu->env;
    env->v7m.fpccr[M_REG_S]=env->v7m.fpccr[M_REG_S];
    env->sau.ctrl=0;
    env->sau.rbar[M_REG_NS]=0;
    s->armv7m.cpu->sau_sregion=0;
    env->sau.rlar[M_REG_NS]=0;
    env->v7m.ccr[M_REG_NS]=0;
    env->v7m.ccr[M_REG_S]=0x211;
    env->v7m.aircr=0x0fa05200;


 }


static void stm32l552_soc_realize(DeviceState *dev_soc, Error **errp)
{
    STM32U535State *s = STM32U535_SOC(dev_soc);
    MemoryRegion *system_memory = get_system_memory();
    DeviceState *dev, *armv7m;
    SysBusDevice *busdev;
    Error *err = NULL;
    int i;

    /*
     * We use s->refclk internally and only define it with qdev_init_clock_in()
     * so it is correctly parented and not leaked on an init/deinit; it is not
     * intended as an externally exposed clock.
     */
    if (clock_has_source(s->refclk)) {
        error_setg(errp, "refclk clock must not be wired up by the board code");
        return;
    }

    if (!clock_has_source(s->sysclk)) {
        error_setg(errp, "sysclk clock must be wired up by the board code");
        return;
    }



    /*
     * TODO: ideally we should model the SoC RCC and its ability to
     * change the sysclk frequency and define different sysclk sources.
     */

    /* The refclk always runs at frequency HCLK / 8 */
    clock_set_mul_div(s->refclk, 8, 1);
    clock_set_source(s->refclk, s->sysclk);

// flash_alias

    memory_region_init_rom(&s->flash, OBJECT(dev_soc), "STM32L552.flash",
                           FLASH_SIZE, &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }


    uint32_t *flash_data = (uint32_t *)memory_region_get_ram_ptr(&s->flash);

    for (int i = 0; i < FLASH_SIZE / sizeof(uint32_t); i++) {
        flash_data[i] = 0xFFFFFFFFU;
    }

    memory_region_set_dirty(&s->flash, 0, FLASH_SIZE);
    //memory_region_flush_rom_device(&s->flash, 0, FLASH_SIZE);
    
    memory_region_init_alias(&s->flash_alias, OBJECT(dev_soc),
                             "STM32L552.flash.alias", &s->flash, 0,
                             FLASH_SIZE);

    memory_region_add_subregion(system_memory, FLASH_BASE_ADDRESS, &s->flash);
    memory_region_add_subregion(system_memory, 0, &s->flash_alias);
/*
"FLASH_REG","40022000"

*/
    /* Flash registers controller */
    dev = DEVICE(&s->flash_regs);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->flash_regs), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x40022000);
/// ADC
    dev = DEVICE(&(s->adc));
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->adc), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x42028000);



    /* ADC device, the IRQs are ORed together */
    if (!object_initialize_child_with_props(OBJECT(s), "adc-orirq",
                                            &s->adc_irqs, sizeof(s->adc_irqs),
                                            TYPE_OR_IRQ, errp, NULL)) {
        return;
    }
    object_property_set_int(OBJECT(&s->adc_irqs), "num-lines", STM_NUM_ADCS,
                            &error_abort);
    if (!qdev_realize(DEVICE(&s->adc_irqs), NULL, errp)) {
        return;
    }

    //sysbus_connect_irq(busdev, 0,
    //                    qdev_get_gpio_in(DEVICE(&s->adc_irqs), i));




    memory_region_init_ram(&s->sram, NULL, "STM32L552.sram", SRAM_SIZE,
                           &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }
    memory_region_add_subregion(system_memory, SRAM_BASE_ADDRESS, &s->sram);

    memory_region_init_ram(&s->ccm, NULL, "STM32L552.ccm", CCM_SIZE,
                           &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }
    memory_region_add_subregion(system_memory, CCM_BASE_ADDRESS, &s->ccm);

    armv7m = DEVICE(&s->armv7m);
    qdev_prop_set_uint32(armv7m, "num-irq", 96);
    qdev_prop_set_string(armv7m, "cpu-type", s->cpu_type);
    qdev_prop_set_bit(armv7m, "enable-bitband", true);
    qdev_connect_clock_in(armv7m, "cpuclk", s->sysclk);
    qdev_connect_clock_in(armv7m, "refclk", s->refclk);
    object_property_set_link(OBJECT(&s->armv7m), "memory",
                             OBJECT(system_memory), &error_abort);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->armv7m), errp)) {
        return;
    }

    init_u5_features(OBJECT(s->armv7m.cpu));

    qdev_connect_gpio_out(DEVICE(&s->adc_irqs), 0,
                          qdev_get_gpio_in(armv7m, ADC_IRQ));


    /* System configuration controller */
    dev = DEVICE(&s->syscfg);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->syscfg), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, SYSCFG_ADD);
    //sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, SYSCFG_IRQ));


    // LPuart1 

    dev = DEVICE(&(s->lpuart1));
    qdev_prop_set_chr(dev, "chardev", serial_hd(0));
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->lpuart1), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0,0x46002400);
    sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, LPUART1_IRQn));

    /* Attach UART (uses USART registers) and USART controllers */
    for (i = 0; i < STM32U535_NUM_USARTS; i++) {
        dev = DEVICE(&(s->usart[i]));
        qdev_prop_set_chr(dev, "chardev", serial_hd(i+1));
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->usart[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, usart_addr[i]);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, usart_irq[i]));
    }


    /* Timer 2 to 5 */
    for (i = 0; i < STM32U535_NUM_TIMERS; i++) {
        dev = DEVICE(&(s->timer[i]));
        qdev_prop_set_uint64(dev, "clock-frequency", 1000000000);
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->timer[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, timer_addr[i]);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, timer_irq[i]));
    }


    /* SPI devices */
    for (i = 0; i < STM_NUM_SPIS; i++) {

        //snprintf(name, NAME_SIZE, "spi[%d]", i);
        //s->spi[i] = sysbus_create_child_obj(obj, name, "stm32fxxx-spi");
        //qdev_prop_set_ptr(DEVICE(s->spi[i]), "regs", &s->state.SPI[i]);
        //qdev_prop_set_uint8(DEVICE(s->spi[i]), "device_id", i);



        dev = DEVICE(&(s->spi[i]));
        if (!sysbus_realize(SYS_BUS_DEVICE(&s->spi[i]), errp)) {
            return;
        }
        busdev = SYS_BUS_DEVICE(dev);
        sysbus_mmio_map(busdev, 0, spi_addr[i]);
        sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, spi_irq[i]));

        if (1==1) {        
            BusState* bus;
            // bus=qdev_get_child_bus(DEVICE(h3), "ssi");
            bus = qdev_get_child_bus(DEVICE(&s->spi[i]), "ssi");
                                 // 
             if (!qdev_realize(DEVICE(&s->asic[i]), bus, errp)) {
                return;
            }

            
            // ssi
            // s->asic1   = ssi_create_peripheral(s->spi[i].ssi ,TYPE_NN1002);
        }

