Ebiroll/qemu-stm32/hw/arm/stm32u535_soc.c
    }


    // create_unimplemented_dual_device("RCC",         0x40023800, 0x400);
    /* RCC Device*/
    dev = DEVICE(&s->rcc);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->rcc), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x46020C00);

    /* RTC Device*/
    dev = DEVICE(&s->rtc);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->rtc), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x46007800);

    /* USB Device*/
    dev = DEVICE(&s->usb);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->usb), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x40016000);

#if 0
    /* DMAMux Device*/
    dev = DEVICE(&s->dmamux);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->dmamux), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x40020800);
#endif

    ////
    dev = DEVICE(&s->pwr);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->pwr), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x46020800);


    /* EXTI device */
    dev = DEVICE(&s->exti);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->exti), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, EXTI_ADDR);
    for (i = 0; i < 16; i++) {
        sysbus_connect_irq(busdev, i, qdev_get_gpio_in(armv7m, exti_irq[i]));
    }

    // sysbus_connect_irq(busdev, 27, qdev_get_gpio_in(armv7m, 62));


    // Alarm A
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc), 0, qdev_get_gpio_in(dev, 22));
    // Alarm B
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc), 1, qdev_get_gpio_in(dev, 22));
    // Wake up timer
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc), 2, qdev_get_gpio_in(dev, 17));

#define NVIC_RTC_ALARM_IRQ 41
#define EXTI_LINE_17 17

    sysbus_connect_irq(busdev, EXTI_LINE_17, qdev_get_gpio_in(armv7m, NVIC_RTC_ALARM_IRQ));
#if 0
  EXTI8_IRQn                = 19,     /*!< EXTI Line8 interrupt                                              */
  EXTI13_IRQn               = 24,     /*!< EXTI Line13 interrupt      
                                     */
#endif
    // ASIC1 & 2 connect interrupts
    dev = DEVICE(&s->exti);
    busdev = SYS_BUS_DEVICE(dev);
    qdev_connect_gpio_out(DEVICE(&s->asic[0]), 0, qdev_get_gpio_in(dev, 8));
    qdev_connect_gpio_out(DEVICE(&s->asic[1]), 0, qdev_get_gpio_in(dev, 13));
    // This tried to connect interrupts direcly to the CPU, Did not work
    //sysbus_connect_irq(busdev, 8, qdev_get_gpio_in(armv7m, 19));
    //sysbus_connect_irq(busdev, 9, qdev_get_gpio_in(armv7m, 19));




    s->armv7m.cpu->env.v7m.secure = false;
    CPUARMState *env = &s->armv7m.cpu->env;
    env->v7m.secure = false;
    env->v7m.fpccr[M_REG_S]=env->v7m.fpccr[M_REG_S];
    env->sau.ctrl=0;
    env->sau.rbar[M_REG_NS]=0;
    s->armv7m.cpu->sau_sregion=0;
    env->sau.rlar[M_REG_NS]=0;
    env->v7m.ccr[M_REG_NS]=0;
    env->v7m.ccr[M_REG_S]=0x211;
    env->v7m.aircr=0x0fa05200;




    //qdev_prop_set_bit(DEVICE(&s->armv7m.cpu->env), "secure", false);

    //for (i = 0; i < 16; i++) {
    //    qdev_connect_gpio_out(DEVICE(&s->syscfg), i, qdev_get_gpio_in(dev, i));
    //}

    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[0], 0x42020000, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[1], 0x42020400, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[2], 0x42020800, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[3], 0x42020C00, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[4], 0x42021000, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[5], 0x42021400, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[6], 0x42021800, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[7], 0x42021C00, 0, errp) < 0) return;
   


    for (i = 0; i < STM_NUM_GPIO; i++) {
        //qdev_prop_set_uint8(DEVICE(&s->gpio[i]), "port_id", i);
        //qdev_prop_set_ptr(DEVICE(s->gpio[i]), "state", &s->state);
        s->gpio[i].port_id = i;

    }

    qdev_connect_gpio_out(DEVICE(&s->gpio[0]), 4,  // PA4
                        qdev_get_gpio_in_named(DEVICE(&s->asic[0]), "cs", 0));


    qdev_connect_gpio_out(DEVICE(&s->gpio[1]), 12,  // PB12
                        qdev_get_gpio_in_named(DEVICE(&s->asic[1]), "cs", 0));

    s->asic[0].asic_num=1;
    s->asic[1].asic_num=2;
    s->asic[2].asic_num=3;
/*


DeviceState *stm32_init_periph(DeviceState *dev, stm32_periph_t periph,
                                        hwaddr addr, qemu_irq irq)
{
    qdev_init_nofail(dev);
    sysbus_mmio_map(SYS_BUS_DEVICE(dev), 0, addr);
    if (irq) {
        sysbus_connect_irq(SYS_BUS_DEVICE(dev), 0, irq);
    }
    return dev;
}

////////////////////////////////////////////
 gpio_realize_peripheral(ARMv7MState *cpu, stm32fxxx_gpio *dev, hwaddr base, unsigned int irqnr, Error **errp){
    SysBusDevice *busdev;
     DeviceState *armv7m;

    //object_property_set_bool(OBJECT(dev), "realized", true,  &error_fatal);
    if (!sysbus_realize(SYS_BUS_DEVICE(dev), errp)) {
        return 0;
    }
    busdev = SYS_BUS_DEVICE(dev);
    armv7m = DEVICE(cpu);
    sysbus_mmio_map(busdev, 0, base);
    sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, irqnr));

    //MemoryRegion *flash_alias = g_new(MemoryRegion, 1);
    //memory_region_init_alias(flash_alias, OBJECT(dev),
    //                         "STM32L552.flash.alias", &dev->flash, 0,
    //                         FLASH_SIZE);

    return 0;

*/
       

    DeviceState *dma1 = qdev_new("l552_dma");    
     if (!sysbus_realize(SYS_BUS_DEVICE(dma1), &error_fatal)) {
       // return 0;
    }
    sysbus_mmio_map(SYS_BUS_DEVICE(dma1), 0,  0x46025000);
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 0, qdev_get_gpio_in(armv7m, GPDMA1_Channel1_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 1, qdev_get_gpio_in(armv7m, GPDMA1_Channel2_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 2, qdev_get_gpio_in(armv7m, GPDMA1_Channel3_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 3, qdev_get_gpio_in(armv7m, GPDMA1_Channel4_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 4, qdev_get_gpio_in(armv7m, GPDMA1_Channel5_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 5, qdev_get_gpio_in(armv7m, GPDMA1_Channel6_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 6, qdev_get_gpio_in(armv7m, GPDMA1_Channel7_IRQn));
    sysbus_connect_irq(SYS_BUS_DEVICE(dma1), 7, qdev_get_gpio_in(armv7m, GPDMA1_Channel8_IRQn));


 

    create_unimplemented_dual_device("ADF",          0x46024000, 0x400);

    create_unimplemented_dual_device("GTZC2_MPCBB4", 0x46023800, 0x400);
    create_unimplemented_dual_device("GTZC2_TZIC",   0x46023400, 0x400);
    create_unimplemented_dual_device("GTZC2_TZSC",   0x46023000, 0x400);

