Ebiroll/qemu-stm32/hw/arm/stm32u535_soc.c
    create_unimplemented_dual_device("EXTI", 0x46022000, 0x400);
    create_unimplemented_dual_device("DAC1", 0x46021800, 0x200);
    create_unimplemented_dual_device("ADC4", 0x46021000, 0x400);
    //create_unimplemented_dual_device("RCC", 0x46021000 , 0x200);
    //create_unimplemented_dual_device("PWR", 0x46020800, 0x400);

    create_unimplemented_dual_device("LPGPIO1", 0x46020000, 0x400);

//0x5600 7C00 - 0x5600 7FFF 0x4600 7C00 - 0x4600 7FFF 1 K TAMP TAMP register map XXXX
//0x5600 7800 - 0x5600 7BFF 0x4600 7800 - 0x4600 7BFF 1 K RTC RTC register map XXXX
//0x5600 7400 - 0x5600 77FF 0x4600 7400 - 0x4600 77FF 1 K VREFBUF VREFBUF register map XXXX
//0x5600 5800 - 0x5600 73FF 0x4600 5800 - 0x4600 73FF 7 K Reserved - ----
//0x5600 5400 - 0x5600 57FF 0x4600 5400 - 0x4600 57FF 1 K COMP(1) COMP register map XXXX
//0x5600 5000 - 0x5600 53FF 0x4600 5000 - 0x4600 53FF 1 K OPAMP OPAMP register map XXXX
//0x5600 4C00 - 0x5600 4FFF 0x4600 4C00 - 0x4600 4FFF 1 K LPTIM4
//LPTIM register map
//XXXX

    create_unimplemented_dual_device("TAMP", 0x46007C00, 0x100);
    // create_unimplemented_dual_device("RTC", 0x46007800, 0x400);
    create_unimplemented_dual_device("VREFBUF", 0x46007400, 0x400);
    create_unimplemented_dual_device("COMP", 0x46005400, 0x400);
    create_unimplemented_dual_device("OPAMP", 0x46005000, 0x400);
    create_unimplemented_dual_device("LPTIM4", 0x46004C00, 0x400);


// 0x5600 4800 - 0x5600 4BFF 0x4600 4800 - 0x4600 4BFF 1 K LPTIM3 XXXX
// 0x5600 4400 - 0x5600 47FF 0x4600 4400 - 0x4600 47FF 1 K LPTIM1 XXXX
// 0x5600 2C00 - 0x5600 43FF 0x4600 2C00 - 0x4600 43FF 6 K Reserved - ----
// 0x5600 2800 - 0x5600 2BFF 0x4600 2800 - 0x4600 2BFF 1 K I2C3 I2C register map XXXX
// 0x5600 2400 - 0x5600 27FF 0x4600 2400 - 0x4600 27FF 1 K LPUART1 LPUART register map XXXX
// 0x5600 2000 - 0x5600 23FF 0x4600 2000 - 0x4600 23FF 1 K SPI3 SPI register map XXXX
// 0x5600 0800 - 0x5600 1FFF 0x4600 0800 - 0x4600 1FFF 6 K Reserved - ----
// 0x5600 0400 - 0x5600 07FF 0x4600 0400 - 0x4600 07FF 1 K SYSCFG SYSCFG register map XXXX
// RM0456 Rev 4 145/3637 RM045 150 AHB2

    create_unimplemented_dual_device("LPTIM3", 0x46004800, 0x400);
    create_unimplemented_dual_device("LPTIM1", 0x46004400, 0x400);
    create_unimplemented_dual_device("I2C3", 0x46002800, 0x400);
    // create_unimplemented_dual_device("LPUART1", 0x46002400, 0x400);
    create_unimplemented_dual_device("SPI3", 0x46002000, 0x400);
    create_unimplemented_dual_device("SYSCFG", 0x46000400, 0x400);

/*
0x520D 3800 - 0x5600 03FF 0x420D 3800 - 0x4600 03FF 64.3 M Reserved - ----
0x520D 3400 - 0x520D 37FF 0x420D 3400 - 0x420D 37FF 1 K HSPI1 HSPI register map - - XX
0x520D 2800 - 0x520D 33FF 0x420D 2800 - 0x420D 33FF 3 K Reserved - ----
0x520D 2400 - 0x520D 27FF 0x420D 2400 - 0x420D 27FF 1 K OCTOSPI2
registers OCTOSPI register map - XXX
0x520D 1800 - 0x520D 23FF 0x420D 1800 - 0x420D 23FF 3 K Reserved - ----
0x520D 1400 - 0x520D 17FF 0x420D 1400 - 0x420D 17FF 1 K OCTOSPI1
registers OCTOSPI register map XXXX
0x520D 0800 - 0x520D 13FF 0x420D 0800 - 0x420D 13FF 3 K Reserved - ----
*/

    create_unimplemented_dual_device("HSPI1", 0x420D3400, 0x400);
    create_unimplemented_dual_device("OCTOSPI2", 0x420D2400, 0x400);
    create_unimplemented_dual_device("OCTOSPI1", 0x420D1400, 0x400);

/*
0x520D 0400 - 0x520D 07FF 0x420D 0400 - 0x420D 07FF 1 K FSMC registers FMC register map - XXX
0x520C F800 - 0x520D 03FF 0x420C F800 - 0x420D 03FF 3K Reserved - ----
0x520C F400 - 0x520C F7FF 0x420C F400 - 0x420C F7FF 1 K DLYBOS2
DLYB register map
- XXX
0x520C F000 - 0x520C F3FF 0x420C F000 - 0x420C F3FF 1 K DLYBOS1 X X X X
0x520C 9000 - 0x520C EFFF 0x420C 9000 - 0x420C EFFF 24 K Reserved - ----
0x520C 8C00 - 0x520C 8FFF 0x420C 8C00 - 0x420C 8FFF 1 K SDMMC2 SDMMC register map - XXX
0x520C 8800 - 0x520C 8BFF 0x420C 8800 - 0x420C 8BFF 1 K DLYBSD2
DLYB register map
- XXX
0x520C 8400 - 0x520C 87FF 0x420C 8400 - 0x420C 87FF 1 K DLYBSD1 XXXX
0x520C 8000 - 0x520C 83FF 0x420C 8000 - 0x420C 83FF 1 K SDMMC1 SDMMC register map XXXX
0x520C 5800 - 0x520C 7FFF 0x420C 5800 - 0x420C 7FFF 10 K Reserved - ----
0x520C 5400 - 0x520C 57FF 0x420C 5400 - 0x420C 57FF 1 K OTFDEC2
*/

    create_unimplemented_dual_device("FSMC", 0x420D0400, 0x400);
    create_unimplemented_dual_device("DLYBOS2", 0x420CF400, 0x400);
    create_unimplemented_dual_device("DLYBOS1", 0x420CF000, 0x400);
    create_unimplemented_dual_device("SDMMC2", 0x420C8C00, 0x400);
    create_unimplemented_dual_device("DLYBSD2", 0x420C8800, 0x400);
    create_unimplemented_dual_device("DLYBSD1", 0x420C8400, 0x400);
    create_unimplemented_dual_device("SDMMC1", 0x420C8000, 0x400);
    create_unimplemented_dual_device("OTFDEC2", 0x420C5400, 0x400);

/*
0x520C 5000 - 0x520C 53FF 0x420C 5000 - 0x420C 53FF 1 K OTFDEC1 XXXX
0x520C 4400 - 0x520C 4FFF 0x420C 4400 - 0x420C 4FFF 3 K Reserved - ----
0x520C 4000 - 0x520C 43FF 0x420C 4000 - 0x420C 43FF 1 K OCTOSPIM OCTOSPIM register map - XXX
0x520C 2000 - 0x520C 3FFF 0x420C 2000 - 0x420C 3FFF 8 K PKA PKA register map XXXX
0x520C 1000 - 0x520C 1FFF 0x420C 1000 - 0x420C 1FFF 4 K Reserved - ----
0x520C 0C00 - 0x520C 0FFF 0x420C 0C00 - 0x420C 0FFF 1 K SAES SAES register map XXXX
0x520C 0800 - 0x520C 0BFF 0x420C 0800 - 0x420C 0BFF 1 K RNG RNG register map XXXX
0x520C 0400 - 0x520C 07FF 0x420C 0400 - 0x420C 07FF 1 K HASH HASH register map XXXX
0x520C 0000 - 0x520C 03FF 0x420C 0000 - 0x420C 03FF 1 K AES AES register map XXXX
0x5204 0000 - 0x5205 FFFF 0x4204 0000 - 0x4205 FFFF 128 K OTG_HS OTG_HS register map - - XX
0x5204 0000 - 0x520B FFFF 0x4204 0000 - 0x420B FFFF 512 K OTG_FS OTG_FS register map -X- -
0x5202 C800 - 0x5203 FFFF 0x4202 C800 - 0x4203 FFFF 78 K Reserved - ----
0x5202 C400 - 0x5202 C7FF 0x4202 C400 - 0x4202 C7FF 1 K PSSI PSSI register map XXXX
0x5202 C000 - 0x5202 C3FF 0x4202 C000 - 0x4202 C3FF 1 K DCMI DCMI register map XXXX
0x5202 8400 - 0x5202 BFFF 0x4202 8400 - 0x4202 BFFF 15 K Reserved - ----
0x5202 8000 - 0x5202 83FF 0x4202 8000 - 0x4202 83FF 1 K ADC12(2) ADC register map XXXX
0x5202 2800 - 0x5202 7FFF 0x4202 2800 - 0x4202 7FFF 22 K Reserved - ----

*/
    
    create_unimplemented_dual_device("OTFDEC1", 0x420C5000, 0x400);
    create_unimplemented_dual_device("OCTOSPIM", 0x420C4000, 0x400);
    create_unimplemented_dual_device("PKA", 0x420C2000, 0x400);
    create_unimplemented_dual_device("SAES", 0x420C0C00, 0x400);
    create_unimplemented_dual_device("RNG", 0x420C0800, 0x400);
    create_unimplemented_dual_device("HASH", 0x420C0400, 0x400);
    create_unimplemented_dual_device("AES", 0x420C0000, 0x400);
    create_unimplemented_dual_device("OTG_HS", 0x42040000, 0x10000);
    create_unimplemented_dual_device("OTG_FS", 0x42040000, 0x80000);
    create_unimplemented_dual_device("PSSI", 0x4202C400, 0x400);
    create_unimplemented_dual_device("DCMI", 0x4202C000, 0x400);
    create_unimplemented_dual_device("ADC12", 0x42028000, 0x8000);

