Ebiroll/qemu-stm32/hw/arm/stm32u535_soc.c
/*
0x5202 2400 - 0x5202 27FF 0x4202 2400 - 0x4202 27FF 1 K GPIOJ
GPIO register map
- - XX
0x5202 2000 - 0x5202 23FF 0x4202 2000 - 0x4202 23FF 1 K GPIOI - X X X
0x5202 1C00 - 0x5202 1FFF 0x4202 1C00 - 0x4202 1FFF 1 K GPIOH XXXX
0x5202 1800 - 0x5202 1BFF 0x4202 1800 - 0x4202 1BFF 1 K GPIOG XXXX
0x5202 1400 - 0x5202 17FF 0x4202 1400 - 0x4202 17FF 1 K GPIOF - X X X
0x5202 1000 - 0x5202 13FF 0x4202 1000 - 0x4202 13FF 1 K GPIOE XXXX
0x5202 0C00 - 0x5202 0FFF 0x4202 0C00 - 0x4202 0FFF 1 K GPIOD XXXX
0x5202 0800 - 0x5202 0BFF 0x4202 0800 - 0x4202 0BFF 1 K GPIOC XXXX
0x5202 0400 - 0x5202 07FF 0x4202 0400 - 0x4202 07FF 1 K GPIOB XXXX
0x5202 0000 - 0x5202 03FF 0x4202 0000 - 0x4202 03FF 1 K GPIOA XXXX
AHB1
*/    
    
        create_unimplemented_dual_device("GPIOJ", 0x42022400, 0x400);
        create_unimplemented_dual_device("GPIOI", 0x42022000, 0x400);
        create_unimplemented_dual_device("GPIOH", 0x42021C00, 0x400);
        create_unimplemented_dual_device("GPIOG", 0x42021800, 0x400);
        create_unimplemented_dual_device("GPIOF", 0x42021400, 0x400);
        create_unimplemented_dual_device("GPIOE", 0x42021000, 0x400);
        create_unimplemented_dual_device("GPIOD", 0x42020C00, 0x400);
        create_unimplemented_dual_device("GPIOC", 0x42020800, 0x400);
        create_unimplemented_dual_device("GPIOB", 0x42020400, 0x400);
        create_unimplemented_dual_device("GPIOA", 0x42020000, 0x400);
/*
0x5003 6C00 - 0x5201 FFFF 0x4003 6C00 - 0x4201 FFFF 32.7 M Reserved - ----
0x5003 6400 - 0x5003 6BFF 0x4003 6400 - 0x4003 6BFF 2 K BKPSRAM - XXXX
0x5003 4000 - 0x5003 63FF 0x4003 4000 - 0x4003 63FF 9 K Reserved - ----
Table 6. Memory map and peripheral register boundary addresses (continued)
0x5003 3C00 - 0x5003 3FFF 0x4003 3800 - 0x4003 3BFF 1 K GTZC1_MPCBB6
0x5003 3800 - 0x5003 3BFF 0x4003 3C00 - 0x4003 3FFF 1 K GTZC1_MPCBB5 - - X X
0x5003 3400 - 0x5003 37FF 0x4003 3400 - 0x4003 37FF 1 K GTZC1_MPCBB3 - X X X
0x5003 3000 - 0x5003 33FF 0x4003 3000 - 0x4003 33FF 1 K GTZC1_MPCBB2 XXXX
0x5003 2C00 - 0x5003 2FFF 0x4003 2C00 - 0x4003 2FFF 1 K GTZC1_MPCBB1 XXXX
0x5003 2800 - 0x5003 2BFF 0x4003 2800 - 0x4003 2BFF 1 K GTZC1_TZIC GTZC1 TZIC register map XXXX
0x5003 2400 - 0x5003 27FF 0x4003 2400 - 0x4003 27FF 1 K GTZC1_TZSC GTZC1 TZSC register map XXXX
0x5003 1C00 - 0x5003 23FF 0x4003 1C00 - 0x4003 23FF 2 K Reserved - ----
0x5003 1800 - 0x5003 1BFF 0x4003 1800 - 0x4003 1BFF 1 K DCACHE2
0x5003 1400 - 0x5003 17FF 0x4003 1400 - 0x4003 17FF 1 K DCACHE1 XXXX
0x5003 0800 - 0x5003 13FF 0x4003 0800 - 0x4003 13FF 3 K Reserved - ----
0x5003 0400 - 0x5003 07FF 0x4003 0400 - 0x4003 07FF 1 K ICACHE ICACHE register map XXXX
*/
            
            create_unimplemented_dual_device("BKPSRAM", 0x40036400, 0x400);
            create_unimplemented_dual_device("GTZC1_MPCBB6", 0x40033C00, 0x400);
            create_unimplemented_dual_device("GTZC1_MPCBB5", 0x40033800, 0x400);
            create_unimplemented_dual_device("GTZC1_MPCBB3", 0x40033400, 0x400);
            create_unimplemented_dual_device("GTZC1_MPCBB2", 0x40033000, 0x400);
            create_unimplemented_dual_device("GTZC1_MPCBB1", 0x40032C00, 0x400);
            create_unimplemented_dual_device("GTZC1_TZIC", 0x40032800, 0x400);
            create_unimplemented_dual_device("GTZC1_TZSC", 0x40032400, 0x400);
            create_unimplemented_dual_device("DCACHE2", 0x40031800, 0x400);
            create_unimplemented_dual_device("DCACHE1", 0x40031400, 0x400);
            create_unimplemented_dual_device("ICACHE", 0x40030400, 0x400);

/*
0x5003 0000 - 0x5003 03FF 0x4003 0000 - 0x4003 03FF 18 K Reserved - ----
0x5002 F000 - 0x5002 FFFF 0x4002 F000 - 0x4002 FFFF 1 K GPU2D - - - X X
0x5002 C000 - 0x5002 EFFF 0x4002 C000 - 0x4002 EFFF 1 K GFXMMU GFXMMU register map - - XX
0x5002 BC00 - 0x5002 BFFF 0x4002 BC00 - 0x4002 BFFF 18 K Reserved - ----
0x5002 B000 - 0x5002 BBFF 0x4002 B000 - 0x4002 BBFF 3 K DMA2D DMA2D register map - XXX
0x5002 A000 - 0x5002 AFFF 0x4002 A000 - 0x4002 AFFF 4 K JPEG JPEG codec register map - - -X
0x5002 7000 - 0x5002 AFFF 0x4002 7000 - 0x4002 AFFF 16 K Reserved - ----
0x5002 6000 - 0x5002 6FFF 0x4002 6000 - 0x4002 6FFF 4 K RAMCFG RAMCFG register map XXXX
0x5002 5000 - 0x5002 5FFF 0x4002 5000 - 0x4002 5FFF 4 K MDF1(3) MDF register map XXXX
0x5002 4400 - 0x5002 4FFF 0x4002 4400 - 0x4002 4FFF 3 K Reserved - ----
0x5002 4000 - 0x5002 43FF 0x4002 4000 - 0x4002 43FF 1 K TSC TSC register map XXXX
0x5002 3400 - 0x5002 3FFF 0x4002 3400 - 0x4002 3FFF 3 K Reserved - ----
0x5002 3000 - 0x5002 33FF 0x4002 3000 - 0x4002 33FF 1 K CRC CRC register map XXXX
0x5002 2400 - 0x5002 2FFF 0x4002 2400 - 0x4002 2FFF 3 K Reserved - ----
*/
            
            create_unimplemented_dual_device("GPU2D", 0x4002F000, 0x1000);
            create_unimplemented_dual_device("GFXMMU", 0x4002C000, 0x3000);
            create_unimplemented_dual_device("DMA2D", 0x4002B000, 0xC00);
            create_unimplemented_dual_device("JPEG", 0x4002A000, 0x1000);
            create_unimplemented_dual_device("RAMCFG", 0x40026000, 0x1000);
            create_unimplemented_dual_device("MDF1", 0x40025000, 0x1000);
            create_unimplemented_dual_device("TSC", 0x40024000, 0x400);
            create_unimplemented_dual_device("CRC", 0x40023000, 0x400);

/*  

0x5002 2000 - 0x5002 23FF 0x4002 2000 - 0x4002 23FF 1 K FLASH registers FLASH register map XXXX
0x5002 1800 - 0x5002 1FFF 0x4002 1800 - 0x4002 1FFF 2 K Reserved - ----
0X5002 1400 - 0x5002 17FF 0X4002 1400 - 0x4002 17FF 1 K FMAC FMAC register map XXXX
0X5002 1000 - 0x5002 13FF 0X4002 1000 - 0x4002 13FF 1 K CORDIC CORDIC register map XXXX
0x5002 0000 - 0x5002 0FFF 0x4002 0000 - 0x4002 0FFF 4 K GPDMA1 GPDMA register map XXXX
0x5001 7C00 - 0x5001 FFFF 0x4001 7C00 - 0x4001 FFFF 33 K Reserved - ----
0x5001 6C00 - 0x5001 7BFF 0x4001 6C00 - 0x4001 7BFF 4 K DSI DSI register map - - XX
0x5001 6800 - 0x5001 6BFF 0x4001 6800 - 0x4001 6BFF 1 K LTDC LTDC register map - - XX
0x5001 6400 - 0x5001 67FF 0x4001 6400 - 0x4001 67FF 1 K GFXTIM GFXTIM register map - - -X
0x5001 6400 - 0x5001 6BFF 0x4001 6400 - 0x4001 6BFF 2 K USB RAM - X - - -
0x5001 6000 - 0x5001 63FF 0x4001 6000 - 0x4001 63FF 1 K USB USB register map X- - -
0x5001 5C00 - 0x5001 5FFF 0x4001 5C00 - 0x4001 5FFF 1 K Reserved - ----
0x5001 5800 - 0x5001 5BFF 0x4001 5800 - 0x4001 5BFF 1 K SAI2
0x5001 5400 - 0x5001 57FF 0x4001 5400 - 0x4001 57FF 1 K SAI1 XXXX
0x5001 4C00 - 0x5001 53FF 0x4001 4C00 - 0x4001 53FF 2 K Reserved - ----
0x5001 4800 - 0x5001 4BFF 0x4001 4800 - 0x4001 4BFF 1 K TIM17
TIM16/TIM17 register map XXXX
*/

        // create_unimplemented_dual_device("FLASH", 0x40022000, 0x400);
        create_unimplemented_dual_device("FMAC", 0x40021400, 0x400);
        create_unimplemented_dual_device("CORDIC", 0x40021000, 0x400);
        create_unimplemented_dual_device("GPDMA1", 0x40020000, 0x1000);
        create_unimplemented_dual_device("DSI", 0x40016C00, 0x400);
        create_unimplemented_dual_device("LTDC", 0x40016800, 0x400);
        create_unimplemented_dual_device("GFXTIM", 0x40016400, 0x400);
        //create_unimplemented_dual_device("USB", 0x40016000, 0x400);
        create_unimplemented_dual_device("SAI2", 0x40015800, 0x400);
        create_unimplemented_dual_device("SAI1", 0x40015400, 0x400);
        create_unimplemented_dual_device("TIM17", 0x40014800, 0x400);
/*
0x5001 4400 - 0x5001 47FF 0x4001 4400 - 0x4001 47FF 1 K TIM16 XXXX
0x5001 4000 - 0x5001 43FF 0x4001 4000 - 0x4001 43FF 1 K TIM15 TIM15 register map XXXX
0x5001 3C00 - 0x5001 3FFF 0x4001 3C00 - 0x4001 3FFF 1 K Reserved - ----
0x5001 3800 - 0x5001 3BFF 0x4001 3800 - 0x4001 3BFF 1 K USART1 USART register map XXXX
0x5001 3400 - 0x5001 37FF 0x4001 3400 - 0x4001 37FF 1 K TIM8 TIMx register map XXXX
0x5001 3000 - 0x5001 33FF 0x4001 3000 - 0x4001 33FF 1 K SPI1 SPI register map XXXX
0x5001 2C00 - 0x5001 2FFF 0x4001 2C00 - 0x4001 2FFF 1 K TIM1 TIMx register map XXXX
0x5000 E000 - 0x5001 2BFF 0x4000 E000 - 0x4001 2BFF 19 K Reserved - - - - -
0x5000 DC00 - 0x5000 DFFF 0x4000 DC00 - 0x4000 DFFF 1 K UCPD1 UCPD register map - XXX
0x5000 B000 - 0x5000 DBFF 0x4000 B000 - 0x4000 DBFF 11 K Reserved - ----
0x5000 AC00 - 0x5000 AFFF 0x4000 AC00 - 0x4000 AFFF 1 K FDCAN1 RAM - XXXX
0x5000 A800 - 0x5000 ABFF 0x4000 A800 - 0x4000 ABFF 1 K Reserved - ----
0x5000 A400 - 0x5000 A7FF 0x4000 A400 - 0x4000 A7FF 1 K FDCAN1 FDCAN register map XXXX
0x5000 A000 - 0x5000 A3FF 0x4000 A000 - 0x4000 A3FF 1 K Reserved - ----
*/
        create_unimplemented_dual_device("TIM16", 0x40014400, 0x400);
        create_unimplemented_dual_device("TIM15", 0x40014000, 0x400);
        //create_unimplemented_dual_device("USART1", 0x40013800, 0x400);
        create_unimplemented_dual_device("TIM8", 0x40013400, 0x400);
        create_unimplemented_dual_device("SPI1", 0x40013000, 0x400);
        //create_unimplemented_dual_device("TIM1", 0x40012C00, 0x400);
        create_unimplemented_dual_device("UCPD1", 0x4000DC00, 0x400);
        create_unimplemented_dual_device("FDCAN1", 0x4000AC00, 0x400);
        create_unimplemented_dual_device("FDCAN1", 0x4000A400, 0x400);

