Ebiroll/qemu-stm32/hw/arm/stm32u535_soc.c
        /*
0x5000 9C00 - 0x5000 9FFF 0x4000 9C00 - 0x4000 9FFF 1 K I2C6
0x5000 9800 - 0x5000 9BFF 0x4000 9800 - 0x4000 9BFF 1 K I2C5 - - X X
0x5000 9400 - 0x5000 97FF 0x4000 9400 - 0x4000 97FF 1 K LPTIM2 LPTIM register map XXXX
0x5000 8800 - 0x5000 93FF 0x4000 8800 - 0x4000 93FF 3 K Reserved - ----
0x5000 8400 - 0x5000 87FF 0x4000 8400 - 0x4000 87FF 1 K I2C4 I2C register map XXXX
0x5000 6800 - 0x5000 83FF 0x4000 6800 - 0x4000 83FF 8 K Reserved - ----
0x5000 6400 - 0x5000 67FF 0x4000 6400 - 0x4000 67FF 1 K USART6 USART register map - - XX
0x5000 6000 - 0x5000 63FF 0x4000 6000 - 0x4000 63FF 1 K CRS CRS register map XXXX
0x5000 5C00 - 0x5000 5FFF 0x4000 5C00 - 0x4000 5FFF 1 K Reserved - ----
0x5000 5800 - 0x5000 5BFF 0x4000 5800 - 0x4000 5BFF 1 K I2C2
0x5000 5400 - 0x5000 57FF 0x4000 5400 - 0x4000 57FF 1 K I2C1 XXXX
0x5000 5000 - 0x5000 53FF 0x4000 5000 - 0x4000 53FF 1 K UART5
0x5000 4C00 - 0x5000 4FFF 0x4000 4C00 - 0x4000 4FFF 1 K UART4 XXXX
0x5000 4800 - 0x5000 4BFF 0x4000 4800 - 0x4000 4BFF 1 K USART3 XXXX
0x5000 4400 - 0x5000 47FF 0x4000 4400 - 0x4000 47FF 1 K USART2 - X X X
0x5000 3C00 - 0x5000 43FF 0x4000 3C00 - 0x4000 43FF 2 K Reserved - ----
*/

        create_unimplemented_dual_device("I2C6", 0x40009C00, 0x400);
        create_unimplemented_dual_device("I2C5", 0x40009800, 0x400);
        create_unimplemented_dual_device("LPTIM2", 0x40009400, 0x400);
        create_unimplemented_dual_device("I2C4", 0x40008400, 0x400);
        create_unimplemented_dual_device("USART6", 0x40006400, 0x400);
        create_unimplemented_dual_device("CRS", 0x40006000, 0x400);
        create_unimplemented_dual_device("I2C2", 0x40005800, 0x400);
        create_unimplemented_dual_device("I2C1", 0x40005400, 0x400);
        // create_unimplemented_dual_device("UART5", 0x40005000, 0x400);
        // create_unimplemented_dual_device("UART4", 0x40004C00, 0x400);
        // create_unimplemented_dual_device("USART3", 0x40004800, 0x400);
        // create_unimplemented_dual_device("USART2", 0x40004400, 0x400);

/*
0x5000 3800 - 0x5000 3BFF 0x4000 3800 - 0x4000 3BFF 1 K SPI2 SPI register map XXXX
0x5000 3400 - 0x5000 37FF 0x4000 3400 - 0x4000 37FF 1 K Reserved - ----
0x5000 3000 - 0x5000 33FF 0x4000 3000 - 0x4000 33FF 1 K IWDG IWDG register map XXXX
0x5000 2C00 - 0x5000 2FFF 0x4000 2C00 - 0x4000 2FFF 1 K WWDG WWDG register map XXXX
0x5000 1800 - 0x5000 2BFF 0x4000 1800 - 0x4000 2BFF 5 K Reserved - ----
0x5000 1400 - 0x5000 17FF 0x4000 1400 - 0x4000 17FF 1 K TIM7
0x5000 1000 - 0x5000 13FF 0x4000 1000 - 0x4000 13FF 1 K TIM6 XXXX
0x5000 0C00 - 0x5000 0FFF 0x4000 0C00 - 0x4000 0FFF 1 K TIM5
0x5000 0800 - 0x5000 0BFF 0x4000 0800 - 0x4000 0BFF 1 K TIM4 XXXX
0x5000 0400 - 0x5000 07FF 0x4000 0400 - 0x4000 07FF 1 K TIM3 XXXX
0x5000 0000 - 0x5000 03FF 0x4000 0000 - 0x4000 03FF 1 K TIM2 

*/

        create_unimplemented_dual_device("SPI2", 0x40003800, 0x400);
        create_unimplemented_dual_device("IWDG", 0x40003000, 0x400);
        create_unimplemented_dual_device("WWDG", 0x40002C00, 0x400);
        create_unimplemented_dual_device("TIM7", 0x40001400, 0x400);
        create_unimplemented_dual_device("TIM6", 0x40001000, 0x400);
        create_unimplemented_dual_device("TIM5", 0x40000C00, 0x400);
        create_unimplemented_dual_device("TIM4", 0x40000800, 0x400);
        create_unimplemented_dual_device("TIM3", 0x40000400, 0x400);
        //create_unimplemented_dual_device("TIM2", 0x40000000, 0x400);



#if 0
0x5602 6000 - 0x5FFF FFFF 0x4602 6000 - 0x4FFF FFFF 164 M Reserved - ----
0x5602 5000 - 0x5602 5FFF 0x4602 5000 - 0x4602 5FFF 4 K LPDMA1 LPDMA register map XXXX
0x5602 4000 - 0x5602 4FFF 0x4602 4000 - 0x4602 4FFF 4 K ADF1 ADF register map XXXX
0x5602 3C00 - 0x5602 3FFF 0x4602 3C00 - 0x4602 3FFF 1 K Reserved - ----
0x5602 3800 - 0x5602 3BFF 0x4602 3800 - 0x4602 3BFF 1 K GTZC2_MPCBB4 GTZC2 MPCBB4 register map XXXX
0x5602 3400 - 0x5602 37FF 0x4602 3400 - 0x4602 37FF 1 K GTZC2_TZIC GTZC2 TZIC register map XXXX
0x5602 3000 - 0x5602 33FF 0x4602 3000 - 0x4602 33FF 1 K GTZC2_TZSC GTZC2 TZSC register map XXXX
0x5602 2400 - 0x5602 2FFF 0x4602 2400 - 0x4602 2FFF 3 K Reserved - ----
#endif


}

static Property stm32l552_soc_properties[] = {
    DEFINE_PROP_STRING("cpu-type", STM32U535State, cpu_type),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32l552_soc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = stm32l552_soc_realize;
    device_class_set_props(dc, stm32l552_soc_properties);
    dc->reset = stm32l552_soc_reset;
    /* No vmstate or reset required: device has no internal state */
}

static const TypeInfo stm32l552_soc_info = {
    .name          = TYPE_STM32U535_SOC,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32U535State),
    .instance_init = stm32l552_soc_initfn,
    .class_init    = stm32l552_soc_class_init,
};

static void stm32l552_soc_types(void)
{
    type_register_static(&stm32l552_soc_info);
}

type_init(stm32l552_soc_types)
